buildingElementBC/validation/room3D_complete/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    west
    {
        type            noSlip;
    }
    
    east
    {
        type            noSlip;
    }
    
    south
    {
        type            noSlip;
    }
    
    north
    {
        type            noSlip;
    }
    
    floor
    {
        type            noSlip;
    }
    
    ceiling
    {
        type            noSlip;
    }
}

// ************************************************************************* //