buildingElementBC/validation/room3D_complete/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    west
    {
        type            calculated;
        value           $internalField;
    }
    
    east
    {
        type            calculated;
        value           $internalField;
    }
    
    south
    {
        type            calculated;
        value           $internalField;
    }
    
    north
    {
        type            calculated;
        value           $internalField;
    }
    
    floor
    {
        type            calculated;
        value           $internalField;
    }
    
    ceiling
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //