buildingElementBC/validation/room3D_complete/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    west
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3840;
        startFace       725248;
    }
    east
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3840;
        startFace       729088;
    }
    south
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3072;
        startFace       732928;
    }
    north
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3072;
        startFace       736000;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5120;
        startFace       739072;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5120;
        startFace       744192;
    }
)

// ************************************************************************* //
